Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxHspdm_bf.h
/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.ER */
#define IFX_HSPDM_FLAGSCLEAR_ER_OFF (8u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.BAS */
#define IFX_HSPDM_FLAGSEN_BAS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.BAS */
#define IFX_HSPDM_FLAGSEN_BAS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.BAS */
#define IFX_HSPDM_FLAGSEN_BAS_OFF (0u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.BAE */
#define IFX_HSPDM_FLAGSEN_BAE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.BAE */
#define IFX_HSPDM_FLAGSEN_BAE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.BAE */
#define IFX_HSPDM_FLAGSEN_BAE_OFF (1u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.BBS */
#define IFX_HSPDM_FLAGSEN_BBS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.BBS */
#define IFX_HSPDM_FLAGSEN_BBS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.BBS */
#define IFX_HSPDM_FLAGSEN_BBS_OFF (2u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.BBE */
#define IFX_HSPDM_FLAGSEN_BBE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.BBE */
#define IFX_HSPDM_FLAGSEN_BBE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.BBE */
#define IFX_HSPDM_FLAGSEN_BBE_OFF (3u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.M0S */
#define IFX_HSPDM_FLAGSEN_M0S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.M0S */
#define IFX_HSPDM_FLAGSEN_M0S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.M0S */
#define IFX_HSPDM_FLAGSEN_M0S_OFF (4u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.M0E */
#define IFX_HSPDM_FLAGSEN_M0E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.M0E */
#define IFX_HSPDM_FLAGSEN_M0E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.M0E */
#define IFX_HSPDM_FLAGSEN_M0E_OFF (5u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.M1S */
#define IFX_HSPDM_FLAGSEN_M1S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.M1S */
#define IFX_HSPDM_FLAGSEN_M1S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.M1S */
#define IFX_HSPDM_FLAGSEN_M1S_OFF (6u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.M1E */
#define IFX_HSPDM_FLAGSEN_M1E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.M1E */
#define IFX_HSPDM_FLAGSEN_M1E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.M1E */
#define IFX_HSPDM_FLAGSEN_M1E_OFF (7u)

/** \brief Length for Ifx_HSPDM_FLAGSEN_Bits.ER */
#define IFX_HSPDM_FLAGSEN_ER_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSEN_Bits.ER */
#define IFX_HSPDM_FLAGSEN_ER_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSEN_Bits.ER */
#define IFX_HSPDM_FLAGSEN_ER_OFF (8u)

/** \brief Length for Ifx_HSPDM_OCS_Bits.SUS */
#define IFX_HSPDM_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_HSPDM_OCS_Bits.SUS */
#define IFX_HSPDM_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_HSPDM_OCS_Bits.SUS */
#define IFX_HSPDM_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_HSPDM_OCS_Bits.SUS_P */
#define IFX_HSPDM_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_HSPDM_OCS_Bits.SUS_P */
#define IFX_HSPDM_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_OCS_Bits.SUS_P */
#define IFX_HSPDM_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_HSPDM_OCS_Bits.SUSSTA */
#define IFX_HSPDM_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_HSPDM_OCS_Bits.SUSSTA */
#define IFX_HSPDM_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_OCS_Bits.SUSSTA */
#define IFX_HSPDM_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_HSPDM_KRSTCLR_Bits.CLR */
#define IFX_HSPDM_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_HSPDM_KRSTCLR_Bits.CLR */
#define IFX_HSPDM_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_KRSTCLR_Bits.CLR */
#define IFX_HSPDM_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_HSPDM_KRST1_Bits.RST */
#define IFX_HSPDM_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_HSPDM_KRST1_Bits.RST */
#define IFX_HSPDM_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_KRST1_Bits.RST */
#define IFX_HSPDM_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_HSPDM_KRST0_Bits.RST */
#define IFX_HSPDM_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_HSPDM_KRST0_Bits.RST */
#define IFX_HSPDM_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_KRST0_Bits.RST */
#define IFX_HSPDM_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_HSPDM_KRST0_Bits.RSTSTAT */
#define IFX_HSPDM_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_HSPDM_KRST0_Bits.RSTSTAT */
#define IFX_HSPDM_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_KRST0_Bits.RSTSTAT */
#define IFX_HSPDM_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN0 */
#define IFX_HSPDM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN0 */
#define IFX_HSPDM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN0 */
#define IFX_HSPDM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN1 */
#define IFX_HSPDM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN1 */
#define IFX_HSPDM_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN1 */
#define IFX_HSPDM_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN2 */
#define IFX_HSPDM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN2 */
#define IFX_HSPDM_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN2 */
#define IFX_HSPDM_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN3 */
#define IFX_HSPDM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN3 */
#define IFX_HSPDM_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN3 */
#define IFX_HSPDM_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN4 */
#define IFX_HSPDM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN4 */
#define IFX_HSPDM_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN4 */
#define IFX_HSPDM_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_HSPDM_ACCEN0_Bits.EN5 */
#define IFX_HSPDM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_HSPDM_ACCEN0_Bits.EN5 */
#define IFX_HSPDM_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_ACCEN0_Bits.EN5 */
#define IFX_HSPDM_ACCEN0_EN5_OFF (5u)

